{
  "${ModID}:Test": {
    "NAME": "Test Minigames",
    "DESCRIPTIONS": [
      ""
    ],
    "OPTIONS": [
      "[Leave]"
    ]
  },
  "${ModID}:SlimePopper": {
    "NAME": "[Slime Popper] Play a retro-looking slime themed game.",
    "DESCRIPTIONS": [
      "Pop as many slimes as you can.",
      "Looks like you win a prize!"
    ],
    "OPTIONS": [
      "[Begin] Let's pop some slimes!",
      "[Leave] Well, that was...interesting."
    ]
  },
  "${ModID}:ActOneArcade": {
    "NAME": "The Strange Ritual",
    "DESCRIPTIONS": [
      "You spot a group of #pCultists praying to a strange, dilapidated machine. One of them waves its arms around, bumping into the machine and causing bright #ylights to @flicker@ on and off from the contraption. NL NL The scene piques your interest, and after a round of very familiar violence, you find yourself standing before the machine. NL NL It @flickers@ to #ylife before you, the screen displaying a list of curious #yoptions.",
      "The game was strange, bizarre, and foreign. Yet you felt a spark of #yjoy from engaging with it nonetheless. NL NL Perhaps you could find more of these strange contraptions deeper in the depths of the #pSpire."
    ],
    "OPTIONS": [
      "[Continue on with your adventure]"
    ]
  },
  "${ModID}:ActTwoArcade": {
    "NAME": "The Popular Spot",
    "DESCRIPTIONS": [
      "You see a group of the City's #plowlifes gathering around a bulky machine, #pthieves and #pmuggers pushing each other to try and get closer. NL NL You unsheathe your weapon, then resheathe it a moment later. The machine responds by playing a little jingle. NL NL \"Are you the next challenger? Choose your game!\"",
      "The game ends, and the machine plays another #y~jingle~ mockingly. NL NL \"You were a worthy opponent, come back again!\" NL NL A parting #r@jingle@ plays as you take your leave."
    ],
    "OPTIONS": [
      "[Continue on with your adventure]"
    ]
  },
  "${ModID}:ActThreeArcade": {
    "NAME": "Those Left Behind",
    "DESCRIPTIONS": [
      "Deep within the bounds of the #pBeyond, you find a strange machine trapped within the growth of the #pSpire. Prying the #psickly roots away, a pile of #pbones clatter to your feet as you free the machine, the remains of a soul from long ago. NL NL The machine #ysparks to life, presenting you with a choice.",
      "The game ends, and you reaffirm your #gresolve to climb to the top of this blasted tower. As you turn to leave, you glance back at the pile of #pbones resting near the machine. NL NL Perhaps you should help that soul achieve their final rest before you go."
    ],
    "OPTIONS": [
      "[Bury the Unknown Body]"
    ]
  },
  "${ModID}:gremlinFlip": {
    "NAME": "Gremlin Flip",
    "DESCRIPTIONS": [
      "Gremlin Flip tasks the player with flipping cards to gain #ygold and avoid #rGremlin #rNobs. NL NL The first tile flipped gives the player that much #ygold on the first card, and each subsequent card that is greater than #b1 multiplies the total by the number on the card. For subsequent tiles that are flipped that have the number #b1, #b1 is added to the player's score. Flipping a #rGremlin #rNob causes the player to spill all #ygold and #plose the minigame. NL NL Numbers next to the Nob denote how many Nobs are on that row, and numbers in the top right denote the sum of the numbers in the row. NL Press left-click to flip a tile. NL Press right-click to mark a tile.",
      "With your sharp wits and keen eyes, you managed to avoid the #rGremlin #rNob! NL  NL After a while, the cabinet begins to rattle, spewing out a plethora of #yshiny gold coins. NL NL Upon bringing them to the #bMerchant, he states that he's never seen coins in such condition before, and proposes that you trade some for his wares.",
      "Sadly, you got caught by a #rGremlin #rNob! NL NL While you managed to get away, all of your collected #ygold spilled from your pockets and onto the ground as you ran to safety. NL NL You leave empty handed, and disappointed.",
      "You won #b%1$s #ygold playing #rGremlin #rFlip. NL (Score : #b%2$s ) NL (Difficulty: #b%3$s )",
      "You trade some #ygold for the #bMerchant's wares, and continue with your journey. NL You keep the unspent #ygold in your %1$s.",
      "You politely decline the #bMerchant's offer, and continue with your journey. NL You keep the unspent #ygold in your %1$s.",
      "You exchange your #ygold for the ~ancient~ ~capsule~ and unseal its contents. NL NL You feel #bdifferent, and you feel #genergized. NL NL You keep the unspent #ygold in your %1$s."
    ],
    "OPTIONS": [
      "Begin",
      "Continue...",
      "Leave",
      "[Give #b%1$s gold] Obtain a random #gcommon relic.",
      "[Give #b%1$s gold] Obtain a random #buncommon relic.",
      "[Give #b%1$s gold] Obtain a random #prare relic.",
      "[Give #b%1$s gold] Obtain an ancient capsule?",
      "[Cash Out] Obtain #b%1$s #ygold.",
      "#rwallet",
      "#gsatchel",
      "#binternal #bvariables",
      "#ppurse",
      "[Locked] Requires #b%1$s #ygold.",
      "[Gremlin Flip] Flip tiles and avoid #rGremlin #rNobs!"
    ]
  },
  "${ModID}:BeatPress": {
    "NAME": "Beat Press",
    "DESCRIPTIONS": [
      "Use the mouse or any button you want to hit the balls! Just make sure you time it right.",
      "You feel like the machine is #rlaughing at you.",
      "The machine spits a ~barrage~ of ~balls~ at you! It doesn't hurt very much, but it certainly feels insulting.",
      "The machine #y~glows~ briefly, and you find that you feel just a bit better than you did before.",
      "You feel #b~perfect.~"
    ],
    "OPTIONS": [
      "[Beat Press] Demonstrate your rhythm and precision.",
      "[Start] Ready?",
      "[Finish]",
      "[Ouch] #rLose #r1 #rHP.",
      "[Renewed] #gMax #gHP #g+5. #gHeal #g5 #gHP.",
      "[Perfection] #gMax #gHP #g+",
      ". #gHeal #gto #gfull #gHP.",
      ". #gHeal #g",
      " #gHP."
    ]
  },
  "${ModID}:MastermindMinigame": {
    "NAME": "Mastermind",
    "DESCRIPTIONS": [
      "The goal of Mastermind is to crack the secret code consisting of 4 icons with 6 possible symbols. NL NL You have 8 guesses and after each guess you get hints about the code: black hints mean that icons have the correct symbols and are in the correct places, while white hints mean that icons have the correct symbols, but are in incorrect places. Positions of hints do not correspond to the code, only the number of black and white hints is important. NL NL Good luck!",
      "Congratulations! NL NL After cracking the code, the secret stash opens and you find a treasure of great value inside it.",
      "Too bad... NL NL Better luck next time!"
    ],
    "OPTIONS": [
      "[Mastermind] Crack the code!",
      "[Start]",
      "[Take the treasure] Obtain a random relic.",
      "[Leave]"
    ]
  },
  "${ModID}:Blackjack": {
    "NAME": "Blackjack",
    "DESCRIPTIONS": [
      "In Blackjack, you compete against the dealer to try to assemble the hand of poker cards with the highest value without going over 21. NL NL Different cards are worth different values: NL #y2 #y- #y10: worth the same as their number. NL #yJack, #yQueen, #yKing: worth 10. NL #yAce: Worth either 1 or 11, depending on which is better for your hand. NL NL You and the dealer both start with 2 cards, but you can only see 1 of the dealer's cards.",
      "During your turn, you can choose to either #yHit or #yStand. If you #yHit, you add another random card to your hand, but if that causes your total hand value to go over 21, you go #rbust and #rlose! If you're satisfied with your hand's current total value, you can choose to #yStand, at which point the dealer begins their turn. NL NL The dealer will continue to hit until their total hand value is 17 or more. If the dealer doesn't go bust, whoever has the higher total hand value #gwins! NL NL Winning pays out 3x the amount of your bet."
    ],
    "OPTIONS": [
      "[Continue]",
      "[Begin]",
      "[Blackjack] Bet some gold and earn 3x your bet if you win!"
    ]
  },
  "${ModID}:Fishing": {
    "NAME": "[Fishing] Catch the Fish!",
    "DESCRIPTIONS": [
      "To catch the fish you must deplete its #r@strength@ before your time runs out! NL NL To do so, you must keep it within your #g~catching~ #g~area~ which can be controlled by dragging your mouse within the game area."
    ],
    "OPTIONS": [
      "[Begin] Catch the Fish!",
      "[Leave] Your job here is done."
	  ]
  },
  "${ModID}:ShellGame": {
    "NAME": "[Three Shell Monte] Follow the #yprize as it shuffles around!",
    "DESCRIPTIONS": [
      "\"Step right up! #bThree shells, two rewards, one #pgnarly #pCurse! NL NL Keep your eyes on the #yprize or you'll pick your #pdemise! NL NL #bOne try, no do-overs. Are you ready? Let's start!\"",
      "\"Looks like you won a #pCurse! NL That's not good. NL Oh well! Better luck next time!\"",
      "\"Ah, a mighty #ygift! NL Enjoy!\""
    ],
    "OPTIONS": [
      "#g[Easy] #gCommon Rewards or #rCursed - #rInjury.",
      "#b[Medium] #bUncommon Rewards or #rCursed - #rRegret.",
      "#y[Hard] #yRare Rewards or #rCursed - #rNormality.",
      "[Leave]"
    ]
  },
  "${ModID}:SlidePuzzle": {
    "NAME": "[Slide Puzzle] Solve a Puzzle!",
    "DESCRIPTIONS": [
      "Can you ~solve~ ~the~ ~puzzle?~ Put as many pieces into the correct spot as you can within the #rtime #rlimit! The more you #ysolve, the more you #gwin!",
      "Uh oh! #r@Time@ #r@ran@ #r@out!@ You'll just have to make do with the #gprizes you were able to get.",
      "@Congratulations!@ You won the #g~grand~ #g~prize!~ You also get #yBonus #yGold for doing it so quickly!"
    ],
    "OPTIONS": [
      "[Start]",
      " #b4x4 puzzle, #r90 seconds.",
      " #b3x3 puzzle, #r45 seconds.",
      "[Collect] #gObtain #gRewards.",
      " Gold",
      "Common Potion",
      "Common Card",
      "Common Relic",
      "Uncommon Potion",
      "Uncommon Card",
      "Uncommon Relic",
      "Rare Potion",
      "Rare Card",
      "Rare Relic"
    ]
  },
  "${ModID}:RubikCube": {
    "NAME": "[Puzzle Cube] Unscramble the Cube!",
    "DESCRIPTIONS": [
      "Unscramble the cube within the time limit. NL NL Controls: NL #yLeft #yclick a side of the cube to rotate it clockwise. NL #yLeft #yclick #y+ #yCtrl a side of the cube to rotate it counterclockwise. NL #yRight #yclick and drag to rotate the entire cube."
    ],
    "OPTIONS": [
      "[Start]",
      "Press %s to Give Up"
    ]
  },
  "${ModID}:JellyDrop": {
    "NAME": "[Jelly Drop] Get rid of falling jellies!",
    "DESCRIPTIONS": [
      "Get rid of falling jellies in this fun puzzle game! NL NL Connect 4 or more jellies of the same color to make them disappear! NL NL Arrow key (Left, Right) - Move NL Arrow key (Down) - Fall faster NL Arrow key (Up) or X key - Rotate clockwise NL Z key - Rotate counter-clockwise",
      "Congratulations! NL NL You became the professional Jelly Drop player and got all the prizes.",
      "Nice! NL NL You quickly grab the rewards.",
      "Ouch! NL NL You barely got through the jelly mayhem. NL You are relieved, but return empty handed."
    ],
    "OPTIONS": [
      "[Start] Play for #b90 seconds.",
      "[Collect] #gObtain #gRewards.",
      "[Leave]"
    ]
  }
}